In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [19, 22, 21, 23, 20],
    "Score":[85, 78, 92, 88, 90]
}
df = pd.DataFrame(data)
df

      Name  Age  Score
0    Alice   19     85
1      Bob   22     78
2  Charlie   21     92
3    David   23     88
4      Eva   20     90

In [3]:
df.head(3)

      Name  Age  Score
0    Alice   19     85
1      Bob   22     78
2  Charlie   21     92

In [4]:
df.head

<bound method NDFrame.head of       Name  Age  Score
0    Alice   19     85
1      Bob   22     78
2  Charlie   21     92
3    David   23     88
4      Eva   20     90>

In [5]:
df.describe()

             Age      Score
count   5.000000   5.000000
mean   21.000000  86.600000
std     1.581139   5.458938
min    19.000000  78.000000
25%    20.000000  85.000000
50%    21.000000  88.000000
75%    22.000000  90.000000
max    23.000000  92.000000

In [6]:
df["Score"].mean()

np.float64(86.6)

In [8]:
df[df["Age"] > 20]

      Name  Age  Score
1      Bob   22     78
2  Charlie   21     92
3    David   23     88

In [10]:
df[df["Score"] > 80]

      Name  Age  Score
0    Alice   19     85
2  Charlie   21     92
3    David   23     88
4      Eva   20     90